// Subvocabularies.js - list of subvocabularies.
//
// Author: Alexey Rybakov

//--------------------------------------------------------------------------------------------------

// Create top 100 subvocabulary.
function CreateSubvocabulary_Top100()
{
    return /* bracket must be on the same line */ [

{ E : "a",          R : "любой, один, некий" },
{ E : "about",      R : "о/об, около" },
{ E : "across",     R : "через" },
{ E : "after",      R : "после" },
{ E : "again",      R : "снова" },
{ E : "against",    R : "против" },
{ E : "all",        R : "все, весь" },
{ E : "almost",     R : "почти" },
{ E : "among",      R : "среди" },
{ E : "and",        R : "и" },
{ E : "any",        R : "любой, никто" },
{ E : "as",         R : "поскольку, как" },
{ E : "at",         R : "в" },
{ E : "be",         R : "быть" },
{ E : "because",    R : "потому что" },
{ E : "before",     R : "перед" },
{ E : "between",    R : "между" },
{ E : "but",        R : "а, но" },
{ E : "by",         R : "к, в соответствии с, за, на" },
{ E : "come",       R : "приходить, приезжать" },
{ E : "do",         R : "делать" },
{ E : "down",       R : "вниз" },
{ E : "east",       R : "восток" },
{ E : "enough",     R : "достаточно" },
{ E : "even",       R : "еще, даже" },
{ E : "ever",       R : "когда-либо, никогда" },
{ E : "every",      R : "каждый" },
{ E : "far",        R : "самый дальний" },
{ E : "for",        R : "для" },
{ E : "forward",    R : "отправлять, вперед" },
{ E : "from",       R : "из" },
{ E : "get",        R : "получать, заставлять" },
{ E : "give",       R : "давать" },
{ E : "go",         R : "ходить, идти" },
{ E : "have",       R : "иметь съесть выпивать знать" },
{ E : "he",         R : "он" },
{ E : "here",       R : "здесь, сюда" },
{ E : "how",        R : "как" },
{ E : "I",          R : "я" },
{ E : "if",         R : "если" },
{ E : "in",         R : "в" },
{ E : "keep",       R : "продолжать держать оставлять не допускать" },
{ E : "let",        R : "позволять" },
{ E : "little",     R : "маленький" },
{ E : "make",       R : "делать, сделать заставлять" },
{ E : "may",        R : "мочь" },
{ E : "much",       R : "много" },
{ E : "near",       R : "рядом, около" },
{ E : "no",         R : "никакой, нет" },
{ E : "north",      R : "север" },
{ E : "not",        R : "не" },
{ E : "now",        R : "теперь, сейчас" },
{ E : "of",         R : "из, о, от" },
{ E : "off",        R : "прочь, от" },
{ E : "on",         R : "на" },
{ E : "only",       R : "только" },
{ E : "or",         R : "или" },
{ E : "other",      R : "другой" },
{ E : "out",        R : "из, выход" },
{ E : "over",       R : "по, над" },
{ E : "please",     R : "пожалуйста" },
{ E : "put",        R : "помещать" },
{ E : "quite",      R : "весьма" },
{ E : "say",        R : "говорить" },
{ E : "see",        R : "видеть" },
{ E : "seem",       R : "казаться представляться" },
{ E : "send",       R : "посылать" },
{ E : "so",         R : "так" },
{ E : "some",       R : "некоторый, немного" },
{ E : "south",      R : "юг" },
{ E : "still",      R : "все еще" },
{ E : "such",       R : "такой, таким образом" },
{ E : "take",       R : "брать/взять" },
{ E : "than",       R : "чем" },
{ E : "that",       R : "что" },
{ E : "the",        R : "уникальный, уже упомянутый" },
{ E : "then",       R : "тогда" },
{ E : "there",      R : "там, туда" },
{ E : "this",       R : "это, этот" },
{ E : "though",     R : "хотя" },
{ E : "through",    R : "через" },
{ E : "till",       R : "пока, до" },
{ E : "to",         R : "к, до, в" },
{ E : "together",   R : "вместе" },
{ E : "tomorrow",   R : "завтра" },
{ E : "under",      R : "под" },
{ E : "up",         R : "вверх" },
{ E : "very",       R : "очень" },
{ E : "well",       R : "хорошо, намного" },
{ E : "west",       R : "запад" },
{ E : "when",       R : "когда" },
{ E : "where",      R : "где, куда, откуда" },
{ E : "while",      R : "в то время как" },
{ E : "who",        R : "кто" },
{ E : "why",        R : "почему" },
{ E : "will",       R : "быть хотеть" },
{ E : "with",       R : "с" },
{ E : "yes",        R : "да" },
{ E : "yesterday",  R : "вчера" },
{ E : "you",        R : "ты, вы" }

    ];
}

//--------------------------------------------------------------------------------------------------

// Create top 400 things.
function CreateSubvocabulary_Top400Things()
{
    return /* bracket must be on the same line */ [

// 1 - 100
{ E : "account",       R : "счет, считать" },
{ E : "act",           R : "действие" },
{ E : "addition",      R : "дополнение" },
{ E : "adjust",        R : "регулировать, приспосабливать" },
{ E : "advertisement", R : "реклама" },
{ E : "agreement",     R : "соглашение" },
{ E : "air",           R : "воздух, проветривать" },
{ E : "amount",        R : "количество" },
{ E : "amusement",     R : "развлечение" },
{ E : "animal",        R : "животное" },
{ E : "answer",        R : "ответ, отвечать" },
{ E : "apparatus",     R : "аппарат" },
{ E : "approval",      R : "одобрение" },
{ E : "argument",      R : "спор, аргумент" },
{ E : "art",           R : "искусство, художественный" },
{ E : "attack",        R : "нападение, нападать" },
{ E : "attempt",       R : "попытка, пытаться" },
{ E : "attention",     R : "внимание" },
{ E : "attraction",    R : "достопримечательность" },
{ E : "authority",     R : "власть, полномочие" },
{ E : "back",          R : "назад, спина, отступать" },
{ E : "balance",       R : "баланс, уравновешивать" },
{ E : "base",          R : "основной" },
{ E : "behavior",      R : "поведение" },
{ E : "belief",        R : "вера" },
{ E : "birth",         R : "рождение" },
{ E : "bit",           R : "частица, бит" },
{ E : "bite",          R : "укус, кусать" },
{ E : "book",          R : "книга" },
{ E : "blow",          R : "удар, дуть" },
{ E : "body",          R : "тело" },
{ E : "brass",         R : "желтая медь" },
{ E : "bread",         R : "хлеб" },
{ E : "breath",        R : "дыхание" },
{ E : "brother",       R : "брат" },
{ E : "building",      R : "здание, строение" },
{ E : "burn",          R : "ожог, гореть" },
{ E : "burst",         R : "взрыв, взрывать" },
{ E : "business",      R : "бизнес, деловой" },
{ E : "butter",        R : "масло" },
{ E : "canvas",        R : "холст" },
{ E : "care",          R : "забота, лечение" },
{ E : "cause",         R : "причина, вызывать" },
{ E : "chalk",         R : "мел, рисовать мелом" },
{ E : "chance",        R : "шанс, случайный, рисковать" },
{ E : "change",        R : "изменение, замена" },
{ E : "cloth",         R : "ткань, одежда" },
{ E : "coal",          R : "уголь" },
{ E : "color",         R : "цвет" },
{ E : "comfort",       R : "комфорт" },
{ E : "committee",     R : "комитет" },
{ E : "company",       R : "компания" },
{ E : "comparison",    R : "сравнение" },
{ E : "competition",   R : "соревнование, конкуренция" },
{ E : "condition",     R : "условие, обуславливать" },
{ E : "connection",    R : "связь" },
{ E : "control",       R : "контроль" },
{ E : "cook",          R : "готовить" },
{ E : "copper",        R : "красная медь" },
{ E : "copy",          R : "копия" },
{ E : "cork",          R : "пробка" },
{ E : "cotton",        R : "хлопок" },
{ E : "cough",         R : "кашель" },
{ E : "country",       R : "страна" },
{ E : "cover",         R : "покрытие, покрывать, обложка" },
{ E : "crack",         R : "трещина, взламывать" },
{ E : "credit",        R : "кредит, верить" },
{ E : "crime",         R : "преступление" },
{ E : "crush",         R : "давка, сокрушать" },
{ E : "cry",           R : "плакать" },
{ E : "current",       R : "текущий, поток" },
{ E : "curve",         R : "кривая, избегать" },
{ E : "damage",        R : "повреждение, повреждать" },
{ E : "danger",        R : "опасность" },
{ E : "daughter",      R : "дочь" },
{ E : "day",           R : "день" },
{ E : "death",         R : "смерть" },
{ E : "debt",          R : "долг" },
{ E : "decision",      R : "решение" },
{ E : "degree",        R : "уровень, градус, степень" },
{ E : "design",        R : "намереваться" },
{ E : "desire",        R : "желание, желать" },
{ E : "destruction",   R : "разрушение, уничтожение" },
{ E : "detail",        R : "детализировать, детали" },
{ E : "development",   R : "развитие" },
{ E : "digestion",     R : "вываривание" },
{ E : "direction",     R : "управление" },
{ E : "discovery",     R : "открытие" },
{ E : "discussion",    R : "обсуждение" },
{ E : "disease",       R : "болезнь" },
{ E : "disgust",       R : "отвращение" },
{ E : "distance",      R : "дистанция" },
{ E : "distribution",  R : "распределение" },
{ E : "division",      R : "подразделение" },
{ E : "doubt",         R : "сомнение" },
{ E : "drink",         R : "пить, напиток" },
{ E : "driving",       R : "вождение" },
{ E : "dust",          R : "чистить, пыль" },
{ E : "earth",         R : "земля" },
{ E : "edge",          R : "продвигаться, край" }

// 101 - 200
education	образование
effect	производить, эффект
end	заканчивать, конец
error	ошибка
event	случай, событие
example	пример
exchange	обмен, обменивать
existence	существование
expansion	расширение
experience	опыт, испытывать
expert	опыт, эксперт
fact	факт
fall	падение, осень
family	семья
father	папа
fear	бояться, страх
feeling	чувство
fiction	беллетристика, фикция
field	область, поле, выставлять
fight	борьба, бороться
fire	огонь
flame	пылать, пламя
flight	полет, рейс
flower	цветок
fold	сгиб, сворачивать
food	еда, продовольствие
force	сила, вынуждать, вызывать
form	форма
friend	друг
front	выходить, фронт, передний
fruit	фрукт
glass	стекло, стакан
gold	золото
government	государство
grain	зерно
grass	трава
grip	власть, захват, захватывать, держать
group	группа
growth	рост
guide	гид, справочник, путеводитель, вести
harbor	предоставлять кров, питать, вставать на якорь, гавань
harmony	гармония
hate	ненавидеть, очень не хотеть, ненависть
hearing	слушание, слышать
heat	нагревать, нагреваться, высокая температура
help	помощь, помогать
history	история
hole	продырявливать, отверстие
hope	надежда, надеяться
hour	час
humor	юмор
ice	лёд
idea	идея
impulse	импульс
increase	увеличивать, увеличиваться, увеличение
industry	индустрия
ink	чернила
insect	насекомое
instrument	инструмент
insurance	страховка
interest	интерес, процент, интересоваться
invention	изобретение
iron	утюг, гладить
jelly	превращать в желе, желе
join	присоединяться, объединение, соединение
journey	путешествовать, поездка
judge	судья, судить
jump	прыгать, прыжок
kick	удар, ударить
kiss	поцелуй, целовать
knowledge	знание
land	земля
language	язык
laugh	смеяться, смех
law	законный, закон
lead	принуждать, возглавлять, приводить, вести, привести, побеждать
learning	изучение, обучение
leather	кожа
letter	письмо
level	уровень, выравнивать, направлять
lift	поднимать, лифт
light	освещать, зажигать, легкий, свет
limit	ограничивать
linen	льняной, полотно
liquid	жидкий, жидкость
list	список, перечислять
look	взгляд, вид
loss	потеря
love	любовь
machine	машина
man	человек
manager	руководитель, управляющий
mark	марка
market	рынок
mass	масса
meal	еда
measure	мера, измерять
meat	мясо
meeting	встреча
memory	память

    ];
}

//--------------------------------------------------------------------------------------------------

// Irregular verbs subvocabulary.
function CreateSubvocabulary_IrregularVerbs()
{
    return /* bracket must be on the same line */ [

        ];
}

//--------------------------------------------------------------------------------------------------

// Armor subvocabulary.
function CreateSubvocabulary_Armor()
{
    return /* bracket must be on the same line */ [

        ];
}

//--------------------------------------------------------------------------------------------------

