// Subvocabularies.js - list of subvocabularies.
//
// Author: Alexey Rybakov

//--------------------------------------------------------------------------------------------------

// Create top 100 subvocabulary.
function CreateSubvocabulary_Top100()
{
    return /* bracket must be on the same line */ [

{ E : "a",          R : "любой, один, некий" },
{ E : "about",      R : "о/об, около" },
{ E : "across",     R : "через" },
{ E : "after",      R : "после" },
{ E : "again",      R : "снова" },
{ E : "against",    R : "против" },
{ E : "all",        R : "все, весь" },
{ E : "almost",     R : "почти" },
{ E : "among",      R : "среди" },
{ E : "and",        R : "и" },
{ E : "any",        R : "любой, никто" },
{ E : "as",         R : "поскольку, как" },
{ E : "at",         R : "в" },
{ E : "be",         R : "быть" },
{ E : "because",    R : "потому что" },
{ E : "before",     R : "перед" },
{ E : "between",    R : "между" },
{ E : "but",        R : "а, но" },
{ E : "by",         R : "к, в соответствии с, за, на" },
{ E : "come",       R : "приходить, приезжать" },
{ E : "do",         R : "делать" },
{ E : "down",       R : "вниз" },
{ E : "east",       R : "восток" },
{ E : "enough",     R : "достаточно" },
{ E : "even",       R : "еще, даже" },
{ E : "ever",       R : "когда-либо, никогда" },
{ E : "every",      R : "каждый" },
{ E : "far",        R : "самый дальний" },
{ E : "for",        R : "для" },
{ E : "forward",    R : "отправлять, вперед" },
{ E : "from",       R : "из" },
{ E : "get",        R : "получать, заставлять" },
{ E : "give",       R : "давать" },
{ E : "go",         R : "ходить, идти" },
{ E : "have",       R : "иметь съесть выпивать знать" },
{ E : "he",         R : "он" },
{ E : "here",       R : "здесь, сюда" },
{ E : "how",        R : "как" },
{ E : "I",          R : "я" },
{ E : "if",         R : "если" },
{ E : "in",         R : "в" },
{ E : "keep",       R : "продолжать держать оставлять не допускать" },
{ E : "let",        R : "позволять" },
{ E : "little",     R : "маленький" },
{ E : "make",       R : "делать, сделать заставлять" },
{ E : "may",        R : "мочь" },
{ E : "much",       R : "много" },
{ E : "near",       R : "рядом, около" },
{ E : "no",         R : "никакой, нет" },
{ E : "north",      R : "север" },
{ E : "not",        R : "не" },
{ E : "now",        R : "теперь, сейчас" },
{ E : "of",         R : "из, о, от" },
{ E : "off",        R : "прочь, от" },
{ E : "on",         R : "на" },
{ E : "only",       R : "только" },
{ E : "or",         R : "или" },
{ E : "other",      R : "другой" },
{ E : "out",        R : "из, выход" },
{ E : "over",       R : "по, над" },
{ E : "please",     R : "пожалуйста" },
{ E : "put",        R : "помещать" },
{ E : "quite",      R : "весьма" },
{ E : "say",        R : "говорить" },
{ E : "see",        R : "видеть" },
{ E : "seem",       R : "казаться представляться" },
{ E : "send",       R : "посылать" },
{ E : "so",         R : "так" },
{ E : "some",       R : "некоторый, немного" },
{ E : "south",      R : "юг" },
{ E : "still",      R : "все еще" },
{ E : "such",       R : "такой, таким образом" },
{ E : "take",       R : "брать/взять" },
{ E : "than",       R : "чем" },
{ E : "that",       R : "что" },
{ E : "the",        R : "уникальный, уже упомянутый" },
{ E : "then",       R : "тогда" },
{ E : "there",      R : "там, туда" },
{ E : "this",       R : "это, этот" },
{ E : "though",     R : "хотя" },
{ E : "through",    R : "через" },
{ E : "till",       R : "пока, до" },
{ E : "to",         R : "к, до, в" },
{ E : "together",   R : "вместе" },
{ E : "tomorrow",   R : "завтра" },
{ E : "under",      R : "под" },
{ E : "up",         R : "вверх" },
{ E : "very",       R : "очень" },
{ E : "well",       R : "хорошо, намного" },
{ E : "west",       R : "запад" },
{ E : "when",       R : "когда" },
{ E : "where",      R : "где, куда, откуда" },
{ E : "while",      R : "в то время как" },
{ E : "who",        R : "кто" },
{ E : "why",        R : "почему" },
{ E : "will",       R : "быть хотеть" },
{ E : "with",       R : "с" },
{ E : "yes",        R : "да" },
{ E : "yesterday",  R : "вчера" },
{ E : "you",        R : "ты, вы" }

    ];
}

//--------------------------------------------------------------------------------------------------

// Irregular verbs subvocabulary.
function CreateSubvocabulary_IrregularVerbs()
{
    return /* bracket must be on the same line */ [

        ];
}

//--------------------------------------------------------------------------------------------------

// Armor subvocabulary.
function CreateSubvocabulary_Armor()
{
    return /* bracket must be on the same line */ [

        ];
}

//--------------------------------------------------------------------------------------------------

